print("Hello World")
# 변수 만들기
a = 1
# 파이썬 변수 이름 만드는 규칙
"""
1. 영어(대소문자 구분), 숫자, 언더바(_)
2. 이름은 숫자로 시작할 수 없다.
3. 파이선의 키워드(문법속 단어) 등을 변수로 쓸 수 없다.
ex) if, else, for, in (x)
    a_if(o)

참고사항) 변수의 이름을 만들 때는 변수 속
데이터의 특징에 맞는 이름을 지어준다.

average = 100 << 학생들의 평균 점수
iMath = 100
fAverage = 98.6
"""
a = "Python"
print(a)

# 파이썬에서 주석문(설명) 만들기

"""
1. 주석문이 여러줄이면 따옴표 3개로 묶은 부분을
주석으로 인식한다.

2. 주석문이 한줄이면 샾문자로 시작한 줄을
주석으로 인식한다.

"""

# 숫자형 (10, 8, 16 진수 중심으로)
"""
1. 파이썬에서 기본 숫자표현은 10진수이다.
2. 숫자 표현을 8진수, 16진수로 표기하고 싶을 경우는
    - 8진수 숫자(0)소문자오(O)숫자 ex) 0o14
    - 16진수 숫자(0)소문자엑스(x)숫자 ex) 0x3f
"""















